## TD - Pandas

In [1]:
import pandas as pd
import numpy as np

In [15]:
series = pd.Series([1,2,3,4,5, np.nan, "a string", 6])

print(series)

0           1
1           2
2           3
3           4
4           5
5         NaN
6    a string
7           6
dtype: object

In [17]:
# De la serie au Dataframe
df = pd.DataFrame(np.array([1,2,3,4,5,6]).reshape(2,3))
df

   0  1  2
0  1  2  3
1  4  5  6

In [18]:
# types des données 
df.dtypes

0    int64
1    int64
2    int64
dtype: object

In [19]:
# Parametrer le dataframe
df = pd.DataFrame(np.array([1,2,3,4,5,6]).reshape(2,3), columns=list('ABC'), index=list('XY'))

df

   A  B  C
X  1  2  3
Y  4  5  6

In [21]:
# Option d'affichage du dataFrame
df2 = pd.DataFrame(np.arange(1,7501).reshape(500,15))

# recup les deux first line du dataset
df2.head(2)

   0   1   2   3   4   5   6   7   8   9   10  11  12  13  14
0   1   2   3   4   5   6   7   8   9  10  11  12  13  14  15
1  16  17  18  19  20  21  22  23  24  25  26  27  28  29  30
2  31  32  33  34  35  36  37  38  39  40  41  42  43  44  45
3  46  47  48  49  50  51  52  53  54  55  56  57  58  59  60
4  61  62  63  64  65  66  67  68  69  70  71  72  73  74  75

In [22]:
# recup les 5 premières ligne du dataset
df2.head()

   0   1   2   3   4   5   6   7   8   9   10  11  12  13  14
0   1   2   3   4   5   6   7   8   9  10  11  12  13  14  15
1  16  17  18  19  20  21  22  23  24  25  26  27  28  29  30
2  31  32  33  34  35  36  37  38  39  40  41  42  43  44  45
3  46  47  48  49  50  51  52  53  54  55  56  57  58  59  60
4  61  62  63  64  65  66  67  68  69  70  71  72  73  74  75

In [23]:
#  Il est utile pour vérifier rapidement les données du dataset
df2.tail(1)

,0,1,2,3,4,5,6,7,8,9,10,11,12,13,14
499,7486,7487,7488,7489,7490,7491,7492,7493,7494,7495,7496,7497,7498,7499,7500

In [25]:
# Statistique predictive
df3 = pd.DataFrame(np.arange(1, 100,0.12).reshape(33,25))
df3.describe()

,0,1,2,3,4,5,6,7,8,9,...,15,16,17,18,19,20,21,22,23,24
count,33.000000,33.000000,33.000000,33.000000,33.000000,33.000000,33.000000,33.000000,33.000000,33.000000,...,33.000000,33.000000,33.000000,33.000000,33.000000,33.000000,33.000000,33.000000,33.000000,33.000000
mean,49.000000,49.120000,49.240000,49.360000,49.480000,49.600000,49.720000,49.840000,49.960000,50.080000,...,50.800000,50.920000,51.040000,51.160000,51.280000,51.400000,51.520000,51.640000,51.760000,51.880000
std,29.008619,29.008619,29.008619,29.008619,29.008619,29.008619,29.008619,29.008619,29.008619,29.008619,...,29.008619,29.008619,29.008619,29.008619,29.008619,29.008619,29.008619,29.008619,29.008619,29.008619
min,1.000000,1.120000,1.240000,1.360000,1.480000,1.600000,1.720000,1.840000,1.960000,2.080000,...,2.800000,2.920000,3.040000,3.160000,3.280000,3.400000,3.520000,3.640000,3.760000,3.880000
25%,25.000000,25.120000,25.240000,25.360000,25.480000,25.600000,25.720000,25.840000,25.960000,26.080000,...,26.800000,26.920000,27.040000,27.160000,27.280000,27.400000,27.520000,27.640000,27.760000,27.880000
50%,49.000000,49.120000,49.240000,49.360000,49.480000,49.600000,49.720000,49.840000,49.960000,50.080000,...,50.800000,50.920000,51.040000,51.160000,51.280000,51.400000,51.520000,51.640000,51.760000,51.880000
75%,73.000000,73.120000,73.240000,73.360000,73.480000,73.600000,73.720000,73.840000,73.960000,74.080000,...,74.800000,74.920000,75.040000,75.160000,75.280000,75.400000,75.520000,75.640000,75.760000,75.880000
max,97.000000,97.120000,97.240000,97.360000,97.480000,97.600000,97.720000,97.840000,97.960000,98.080000,...,98.800000,98.920000,99.040000,99.160000,99.280000,99.400000,99.520000,99.640000,99.760000,99.880000

In [26]:
# Indexation et selection du Dataframe
df3 = pd.DataFrame(np.arange(1,100,0.12).reshape(33,25))
df3.iloc[:5,:10]

      0      1      2      3      4     5      6      7      8      9
0   1.0   1.12   1.24   1.36   1.48   1.6   1.72   1.84   1.96   2.08
1   4.0   4.12   4.24   4.36   4.48   4.6   4.72   4.84   4.96   5.08
2   7.0   7.12   7.24   7.36   7.48   7.6   7.72   7.84   7.96   8.08
3  10.0  10.12  10.24  10.36  10.48  10.6  10.72  10.84  10.96  11.08
4  13.0  13.12  13.24  13.36  13.48  13.6  13.72  13.84  13.96  14.08

In [27]:
df3.iloc[-5:]

,0,1,2,3,4,5,6,7,8,9,...,15,16,17,18,19,20,21,22,23,24
28,85.0,85.12,85.24,85.36,85.48,85.6,85.72,85.84,85.96,86.08,...,86.8,86.92,87.04,87.16,87.28,87.4,87.52,87.64,87.76,87.88
29,88.0,88.12,88.24,88.36,88.48,88.6,88.72,88.84,88.96,89.08,...,89.8,89.92,90.04,90.16,90.28,90.4,90.52,90.64,90.76,90.88
30,91.0,91.12,91.24,91.36,91.48,91.6,91.72,91.84,91.96,92.08,...,92.8,92.92,93.04,93.16,93.28,93.4,93.52,93.64,93.76,93.88
31,94.0,94.12,94.24,94.36,94.48,94.6,94.72,94.84,94.96,95.08,...,95.8,95.92,96.04,96.16,96.28,96.4,96.52,96.64,96.76,96.88
32,97.0,97.12,97.24,97.36,97.48,97.6,97.72,97.84,97.96,98.08,...,98.8,98.92,99.04,99.16,99.28,99.4,99.52,99.64,99.76,99.88

In [39]:
df4 = df3.rename(columns=lambda c: chr(65+c))
# sélection des lignes <=5 & des colonnes de A à D
df4.loc[:5, 'A':'D']

      A      B      C      D
0   1.0   1.12   1.24   1.36
1   4.0   4.12   4.24   4.36
2   7.0   7.12   7.24   7.36
3  10.0  10.12  10.24  10.36
4  13.0  13.12  13.24  13.36
5  16.0  16.12  16.24  16.36

In [40]:
df4.loc[:5, ('A','D')] # sélection des lignes <=5 & des colonnes de A et D

      A      D
0   1.0   1.36
1   4.0   4.36
2   7.0   7.36
3  10.0  10.36
4  13.0  13.36
5  16.0  16.36

### Note


```py
#  toutes les lignes et seulement les colonnes A et B.
df.loc[:,['A', 'C']]

# Accès à la valeur de la ligne a2 et de la colonne C.
df.loc['a2', 'C'] : accès à la valeur de la ligne a2 et de la colonne C.

# Accès à certaines colonnes et certaines
df.loc[:,['A', 'b']].iloc[0:2]: 

```

In [ ]:
# CSV & Dataframe